/*    👆                                        
به نام خدا                                                      


*حلقه های اصلی نرم افزار آردوینو                                                                                     

        برنامه آردوینو شامل دو بخش کلی void setup و  void loop  می باشد                                               
محتوای هر کدام از این بخش‌ها بین آکولاد آنها تعریف می‌شود                                                        

void setup()
{
از تابع setup  برای راه اندازی متغیرها، حالت پین های میکرو، پیکربندی                                           
سخت افزارهای میکرو و... استفاده می شود. تابع setup  فقط یک بار بعد                                             
از هر بار روشن کردن یا ریست کردن برد آردوینو اجرا می شود.                                                      
}        

     ________________________________________________________________________________________________________________________
     
حلقه loop یک حلقه بی نهایت است که پس از حلقه setup اجرا می شود                                                  
و دستورات داخل آن تا زمانی که برق برد قطع نشود اجرا می شود.                                                     

void loop()
{
دستورات درون تابع   Loop دائما تکرار می شوند به این صورت که دستورات و                                             
توابع موجود در این تابع از بالا به پایین خط به خط اجرا می شوند تا به انتهای                                        
تابع برسند و بعد از آن مجددا از ابتدای حلقه شروع به اجرای دستورات خواهد کرد                                       
}
     ________________________________________________________________________________________________________________________
  
برای آموزش بیشتر و باخبر شدن از پکیج جدید و همچنین کتابخوانه  جدید به سایت  زیر مراجعه کنید.                         

                                                👉     https://arsalearn.com/     👈               

*/
