/*      👆
به نام خدا                                                     

* آشنایی با کتابخوانه ArsaLearn                                                                                                 


   از include# در آردوینو برای اضافه کردن کتابخانه‌های خارجی به برنامه استفاده می‌شود.     _____________________              
                                           این کار باعث دسترسی  برنامه‌نویس به گروه بزرگی از کتابخانه‌های  آردوینو می شود                              |             
             |
#include<Arsa_esp32_v1.h>
  
   این عبارت مربوط به کتابخانه ArsaLearn  بوده که حتما باید درابتدای  برنامه نوشته شود.                                    
در واقع این عبارت دستورات مورد نیاز ما را فعال می کند .                                                                 

     ________________________________________________________________________________________________________________________

void setup()
{
این دستور باعث فعال شدن سریال مانیتور و همچنین  دستورات مربوط به آن را فعال میکند.                                        
  run();
}
     ________________________________________________________________________________________________________________________

void loop()
{

}
     ________________________________________________________________________________________________________________________
  
برای آموزش بیشتر و باخبر شدن از پکیج جدید و همچنین کتابخوانه  جدید به سایت  زیر مراجعه کنید.                         

                                                👉     https://arsalearn.com/     👈               

*/
