/*            👆 
برای راهنمایی قسمت های برنامه روی گزینه Help کلیک کنید                                                              

برای  اطلاع از بروزرسانی کتابخانه و پکیج جدید و همچنین آموزش بیشتر به سایت زیر مراجعه کنید.                          

                                                        https://arsalearn.com/ 
    ________________________________________________________________________________________________________________________
                                                       
*/

#include<Arsa_esp32_v1.h>
void setup()
{
  run();
}
void loop()
{
  
  pin(led, high);
}
