/*   👆 
                 به نام خدا                                                            

*آشنایی با یکی از کاربرد های دستور Pin  و انجام پروژه اولین پروژه                                                            

     ________________________________________________________________________________________________________________________

#include<Arsa_esp32_v1.h>

void setup()
{
  run();
}

void loop()
{
با استفاده از دستور Pin در این قسمت از برنامه، برنامه به برد دستور خواهد داد که LED  مشخص شده را روشن کند.                    
  
  pin(led, high);
در این قسمت وضعیت LED  را مشخص میکنیم که high به معنای روشن و low به معنای خاموش می باشد.         ___________|___|    |       
       |        |
و در این قسمت شماره پایه LED مورد نظر خود را مشخص میکنیم که منظور از کلمه led همان LED روی برد Main  می باشد   | _______|       
                |
                |
                برای خاتمه دادن به یک عبارت از سمی‌کولن (;) استفاده می‌شود.   ___________|                
                
                
                اگر فراموش کنید که انتهای خط را با ” ; ” تمام کنید، باعث خطای                           
 کامپایلری خواهد شد. این خطا ممکن است واضح باشد و به خطی                                
 که سمی‌کولن ندارد اشاره کند و یا نه. اگر خطای کامپایلریِ غیر‌منطقی                        
 یا به نظر ناصحیح رخ داد، یکی از اولین احتمال‌ها، عدم وجود ” ; ” در یک خط است.           

 

}
     ________________________________________________________________________________________________________________________
  
برای آموزش بیشتر و باخبر شدن از پکیج جدید و همچنین کتابخوانه  جدید به سایت  زیر مراجعه کنید.                         

                                                👉     https://arsalearn.com/     👈               

*/
